{"contents": "<h1>LML Programming Guide</h1>\n\n<p><code>LML</code> is a language for coding songs that can be played in the <em>Play Along</em>\nmode. LML was designed to be easy to write by hand. LML is in early\ndevelopment, but any code you write today will be future compatible. As new\nfunctionality is added to <em>Play Along</em> mode, LML will get new syntax.</p>\n\n<p>Every song on this app is written in LML. Click the <strong>Editor</strong> button to see\nhow a particular song is written.</p>\n\n<h2>Notes</h2>\n\n<p>A note can be added to a song by writing the note's name followed by the\noctave. Notes are placed after the last note added, or the beginning of an\nempty song. Notes must be separated by white space (new lines, spaces, tabs,\netc.).</p>\n\n<pre><code>c5 d5 e5\n</code></pre>\n\n<p>A duration can be specified by appending a period and the multiplier to the end of\na note. The default duration multiplier is <code>1</code>, and the default base duration is 1 beat.</p>\n\n<pre><code>c5.2 d5 d5 e5.4\n</code></pre>\n\n<p>You can change the base duration using the <code>dt</code> (double time), <code>ht</code> (half\ntime), or <code>tt</code> (triple time) commands. These take effect until the end of the\nsong (or block). For example, we can easily write 8th notes with <code>dt</code>:</p>\n\n<pre><code>dt\nc5 d5 c5 d5 c5 d5 e5.2\n</code></pre>\n\n<p>You can use multiple <code>dt</code> (or <code>ht</code>) commands to reduce (or increase) duration\neven more.</p>\n\n<p>You can move the current position back using the <code>|</code> character. This will write\na C Major chord.</p>\n\n<pre><code>c5 | d5 | e5\n</code></pre>\n\n<p>Here's how you might write two voices:</p>\n\n<pre><code>c5 g5 e5.2\n| \nc4.2 f4.2\n</code></pre>\n\n<p>Putting a <code>|</code> the beginning of the song (or block) has no effect, so another\nway to write the above might be:</p>\n\n<pre><code>| c5 g5 e5.2\n| c4.2 f4.2\n</code></pre>\n\n<p>A note can be made sharp with <code>+</code>, flat with <code>-</code>, and natural with <code>=</code>. These\nnote modifiers appear after the note's name, but before the octave.</p>\n\n<pre><code>c+5 c-5\n</code></pre>\n\n<h2>Rests</h2>\n\n<p>You can insert silence using the rest command, <code>r</code>. You can specify a duration\nmultiplier by including a number after the <code>r</code> command. The duration of rests\nworks the same as notes, their base duration is affected by <code>dt</code> and <code>ht</code>, and\nthey have a default base duration of 1 beat.</p>\n\n<pre><code>c5 r d5.2\nd5 r2 a4\n</code></pre>\n\n<h2>Blocks</h2>\n\n<p>A block is delimited with a <code>{</code> and <code>}</code>. Blocks can be nested. Blocks adjust\nhow some of the commands work:</p>\n\n<ul>\n<li><code>|</code> command will move the position back to the start of the block</li>\n<li>Base duration (adjusted with <code>dt</code> and <code>ht</code>), will reset to previous value after </li>\n</ul>\n\n<p>Example:</p>\n\n<pre><code>{\n  {\n    dt\n    c5 { dt e5 f5 } d5.2 e5 g5 a5 c6\n  }\n  |\n  { ht g4 f4 }\n}\n</code></pre>\n\n<h2>Measure movements</h2>\n\n<p>The measure command, <code>m</code>, can be used to move the current position to a\nspecific measure. It's common to use the <code>m</code> command followed by a block to\norganize a piece:</p>\n\n<pre><code>m0 {\n  | c5 c5 a5 g5\n  | g4.4\n}\n\nm1 {\n  | d5 d5 a5 e5\n  | f4.4\n}\n</code></pre>\n\n<h2>Key Signature</h2>\n\n<p>You can specify the number of sharps or flats to use with the <code>ks</code> command\nfollowed by a positive or negative number. Notes you write will automatically\nbe sharp or flat as required by the key signature. You can use the <code>=</code> natural\nmodifier to remove the sharp or flat.</p>\n\n<pre><code>ks-2\nb5 c5 b=5\n</code></pre>\n\n<h2>Time Signature</h2>\n\n<p>Set the time signature using the <code>ts</code> command. This will set <code>3/4</code> time.</p>\n\n<pre><code>ts3/4\n\nc5 g5 g5\n</code></pre>\n\n<p>The time signature will change where measure lines appear, and affect how many\n<em>beats</em> fill up an entire measure. The time signature also affects where\nmeasure movements will place the note position.</p>\n\n<h2>Time Commands</h2>\n\n<p>Time commands change the current time multiplier until the end of the song or\nblock. The time commands are multiplied against the current time multiplier, so\nyou can repeat the commands to stack the effect.</p>\n\n<p>Notes have a duration in beats from 1 to any number you wish. Time commands\nchange the duration multiplier which affects the actual length of the note.</p>\n\n<p>When a note is written without a duration specified, it has a length of 1 beat.\nOtherwise, any whole number can be specified as the length of a note.</p>\n\n<p>By default, the time multiplier is <code>1</code>. In <code>4/4</code> time this means each 1 beat\nnote will be 1 beat long, so a quarter note.</p>\n\n<p>Using <strong>double time</strong>, the multiplier is halved, so each written note of 1 beat\nwill become a eigth note: <code>(1 * 0.5) = 0.5</code>, each note is half a beat.</p>\n\n<p>Here are the time commands:</p>\n\n<ul>\n<li><code>dt</code> -- Double time</li>\n<li><code>ht</code> -- Double time</li>\n<li><code>tt</code> -- Triple Time</li>\n</ul>\n\n<h2>Chords</h2>\n\n<p>The <code>$</code> command can be used to specify a chord using a chord symbol. The chord\nwill take up the entire duration of the block it is placed in. Chords do not\nhave an octave. The notes of the chord will be automatically generated by a\nchord generator if enabled.</p>\n\n<p>The following is a short melody over a G Major and D Minor chord progression.</p>\n\n<pre><code>{$g c5.2 a5 d5}\n{$dm e5 f5 g5.2}\n</code></pre>\n\n<h2>Comments</h2>\n\n<p>If a <code>#</code> appears, then it and any text following will be ignored. You can use\nthis to add notes to anyone reading the code (aka comments).</p>\n"}